Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-06 04:16:23--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.243.54
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.243.54|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  35.1MB/s    in 6.1s

2019-11-06 04:16:30 (31.9 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
# Import libraries
import pandas as pd
import seaborn as sns
import numpy as np

In [7]:
# Load .csv files and take a look to the data
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.sample(2)

(32434489, 4)

          order_id  product_id  add_to_cart_order  reordered
29386908   3099354       45346                  3          1
5231850     552134       45748                  7          0

In [8]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.sample(2)

(1384617, 4)

        order_id  product_id  add_to_cart_order  reordered
410985   1006363       47766                  3          1
740923   1823729       16797                  7          0

In [9]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.sample(2)

(3421083, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
386997     182891    23254  ...                11                    30.0
3097244    315483   186777  ...                10                     7.0

[2 rows x 7 columns]

In [10]:
products = pd.read_csv('products.csv')
print(products.shape)
products.sample(2)

(49688, 4)

       product_id                   product_name  aisle_id  department_id
36551       36552  Gourmet Popping Corn Original        23             19
17495       17496      Hard Seltzer Black Cherry       100             21

In [11]:
# We need to merge the dataframe `products` with `order_products__prior` and `order_products__train`
# But `order_products__prior` and `order_products__train` have the same number of columns, 
# same column names and the columns are displayed in the same order
# Firt let's concatenate `order_products__prior` and `order_products__train` into a dataframe called `order_products`

order_products = pd.concat([order_products__prior, order_products__train])

# Display columns of `order_products` and `products` dataframes
print(order_products.columns)
print(products.columns)

Index(['order_id', 'product_id', 'add_to_cart_order', 'reordered'], dtype='object')
Index(['product_id', 'product_name', 'aisle_id', 'department_id'], dtype='object')

In [12]:
# To see how many times a product was ordered, we need only 3 columns from the above dataframes:
# order_id, product_id, and product_name

# Make the selection of columns from `order_products`
columns = ['order_id', 'product_id']

# Filter columns for `order_products`
order_products_subset = order_products[columns]
order_products_subset.sample(2)

          order_id  product_id
26861754   2832500       22760
26163597   2759155       28441

In [13]:
# Make the selection of columns from `products`
columns = ['product_id', 'product_name']

# Filter columns for `products`
products_subset = products[columns]
products_subset.sample(2)

       product_id                          product_name
46068       46069                          Supergreens!
36856       36857  Gluten Free Double Chocolate Muffins

In [14]:
# Merge the dataframes
order_products_names = pd.merge(order_products_subset, products_subset, on='product_id', how='left')
order_products_names.sample(5)

          order_id  product_id                    product_name
1092055     115252       37538               Organic Sweet Pea
20699469   2183628       21267                 Sourdough Bread
16100665   1698726       10895  Mexican Finely Shredded Cheese
25804786   2721363       36082                   Organic Mango
28141900   2967636       33671            100% Pineapple Juice

In [15]:
# Count the most popular 10 products
order_products_names['product_name'].value_counts(ascending=False, dropna=False).head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

**Table 1 --> Tidy**

In [0]:
# Create table1
myindex = ['John Smith', 'Jane Doe', 'Mary Johnson']
mycolumns = ['treatmenta', 'treatmentb']

table1 = pd.DataFrame([[np.NAN, 2], [16,11], [3,1]], columns=mycolumns, index=myindex)
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
# Create table2
table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# Reshape table1 into Tidy format

# Get column names
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [0]:
# Get the index values
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [0]:
# Convert the index into a column
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [0]:
# Convert the table from wide to tidy format
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
# Rename the columns
tidy = tidy.rename(columns={'index':'name', 'variable':'trt', 'value':'result'})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [0]:
# Shorten the `trt` values
tidy['trt'] = tidy['trt'].str.replace('treatment','')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

**Table 2 --> Tidy**

In [0]:
# Get column and index values
print("Columns:", table2.columns.tolist())
print("Indexes:", table2.index.tolist())

Columns: ['John Smith', 'Jane Doe', 'Mary Johnson']
Indexes: ['treatmenta', 'treatmentb']

In [0]:
# Convert the index into a column
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
# Convert the table from wide to tidy format
tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
# Rename the columns and shorten the treatment values
tidy2 = tidy2.rename(columns={'index':'trt', 'variable':'name', 'value':'result'})
tidy2['trt'] = tidy2['trt'].str.replace('treatment','')
tidy2

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

**Tidy --> Table 1**

In [0]:
# Convert Tidy to Table 1 (wide format)
wide1 = tidy.pivot_table(index='name', columns='trt', values='result')
wide1

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

**Tidy --> Table 2**

In [0]:
# Convert Tidy 2 to Table 2
wide2 = tidy2.pivot_table(index='trt', columns='name', values='result')
wide2

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

**Flight dataset**

Task: create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Load data
flights = sns.load_dataset('flights')
flights.sample(10)

     year      month  passengers
9    1949    October         119
59   1953   December         201
1    1949   February         118
139  1960     August         606
98   1957      March         356
100  1957        May         355
20   1950  September         158
112  1958        May         363
47   1952   December         194
13   1950   February         126

In [0]:
# Create pivot table
flights_pivot = flights.pivot_table(index='year', columns='month', values='passengers')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [17]:
# Look at the data
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [14]:
# Add product names to the dataframe
order_products_names = pd.merge(order_products, products_subset, on='product_id', how='inner')
print(order_products_names.shape)
order_products_names.head()

(33819106, 5)

   order_id  product_id  add_to_cart_order  reordered        product_name
0         2       33120                  1          1  Organic Egg Whites
1        26       33120                  5          0  Organic Egg Whites
2       120       33120                 13          0  Organic Egg Whites
3       327       33120                  5          1  Organic Egg Whites
4       390       33120                 28          1  Organic Egg Whites

In [21]:
# Number of purchases by product
products_purchased = pd.DataFrame(order_products_names['product_name'].value_counts())
products_purchased.head()

                        product_name
Banana                        491291
Bag of Organic Bananas        394930
Organic Strawberries          275577
Organic Baby Spinach          251705
Organic Hass Avocado          220877

In [0]:
# to be continued